<?php
//PandaOpenNode 配置文件
return array(
	'version'=>array(
		'v'=>'1.2.1',
		'name'=>'熊猫创意开源节点', //自行修改节点名
		'limit'=>0,//同时可查询多少网址，默认是0，即不限制。 这个配置是客户端读取的，不可依赖此设置。
	),
    //白名单，位于白名单中的域名可以使用本节点查询。但不能防止第三方恶意使用。
    'source'=>array(
        'tools.meettea.com',
        'baidu.pandaidea.com',
    ),
    //百度的多个IP，单线用户可注释掉一些IP。如果查询量少，可删除所有IP，只剩一个www.baidu.com
    'baiduip'=>array(
    	//联通
        '61.135.169.105',
        '61.135.169.125',
        '123.125.115.165',
        '202.108.22.5',
        '202.108.22.142',
        //电信
        '220.181.6.175',
        '220.181.111.147',
        '220.181.111.148',
        '220.181.111.149',
        '220.181.112.143',
        //百度网讯
        '119.75.217.56',
        '119.75.217.109',
        '119.75.218.77',
        '119.75.218.70',
        '119.75.218.45',
    ),
       
);